Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/icm.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief ICM_DESCRIPTOR register API structure */
typedef struct
{  /* Region Descriptor Structure */
  __IO  uint32_t                       ICM_RADDR;          /**< Offset: 0x00 (R/W  32) Region Start Address */
  __IO  uint32_t                       ICM_RCFG;           /**< Offset: 0x04 (R/W  32) Region Configuration */
  __IO  uint32_t                       ICM_RCTRL;          /**< Offset: 0x08 (R/W  32) Region Control */
  __IO  uint32_t                       ICM_RNEXT;          /**< Offset: 0x0C (R/W  32) Region Next Address */
} icm_descriptor_registers_t
#ifdef __GNUC__
  __attribute__ ((aligned (8)))
#endif
;

/** \brief ICM register API structure */
typedef struct
{
  __IO  uint32_t                       ICM_CFG;            /**< Offset: 0x00 (R/W  32) Configuration Register */
  __O   uint32_t                       ICM_CTRL;           /**< Offset: 0x04 ( /W  32) Control Register */
  __I   uint32_t                       ICM_SR;             /**< Offset: 0x08 (R/   32) Status Register */
  __I   uint8_t                        Reserved1[0x04];
  __O   uint32_t                       ICM_IER;            /**< Offset: 0x10 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       ICM_IDR;            /**< Offset: 0x14 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       ICM_IMR;            /**< Offset: 0x18 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       ICM_ISR;            /**< Offset: 0x1C (R/   32) Interrupt Status Register */
  __I   uint32_t                       ICM_UASR;           /**< Offset: 0x20 (R/   32) Undefined Access Status Register */
  __I   uint8_t                        Reserved2[0x0C];
  __IO  uint32_t                       ICM_DSCR;           /**< Offset: 0x30 (R/W  32) Region Descriptor Area Start Address Register */
  __IO  uint32_t                       ICM_HASH;           /**< Offset: 0x34 (R/W  32) Region Hash Area Start Address Register */
  __O   uint32_t                       ICM_UIHVAL0;        /**< Offset: 0x38 ( /W  32) User Initial Hash Value 0 Register 0 */
  __O   uint32_t                       ICM_UIHVAL1;        /**< Offset: 0x3C ( /W  32) User Initial Hash Value 0 Register 1 */
  __O   uint32_t                       ICM_UIHVAL2;        /**< Offset: 0x40 ( /W  32) User Initial Hash Value 0 Register 2 */
  __O   uint32_t                       ICM_UIHVAL3;        /**< Offset: 0x44 ( /W  32) User Initial Hash Value 0 Register 3 */
  __O   uint32_t                       ICM_UIHVAL4;        /**< Offset: 0x48 ( /W  32) User Initial Hash Value 0 Register 4 */
  __O   uint32_t                       ICM_UIHVAL5;        /**< Offset: 0x4C ( /W  32) User Initial Hash Value 0 Register 5 */
  __O   uint32_t                       ICM_UIHVAL6;        /**< Offset: 0x50 ( /W  32) User Initial Hash Value 0 Register 6 */
  __O   uint32_t                       ICM_UIHVAL7;        /**< Offset: 0x54 ( /W  32) User Initial Hash Value 0 Register 7 */
  __I   uint8_t                        Reserved3[0x8C];
  __IO  uint32_t                       ICM_WPMR;           /**< Offset: 0xE4 (R/W  32) ICM Write Protection Mode Register */
  __I   uint32_t                       ICM_WPSR;           /**< Offset: 0xE8 (R/   32) ICM Write Protection Status Register */
} icm_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** \brief ICM_DESCRIPTOR memory section attribute */
#define SECTION_ICM_DESCRIPTOR

#endif /* _SAMRH71_ICM_COMPONENT_H_ */
